Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input (InputLayer)          [(None, 4)]               0         
                                                                 
 test-14_dense_0 (Dense)     (None, 1024)              5120      
                                                                 
 test-14_bnorm_0 (BatchNorm  (None, 1024)              4096      
 alization)                                                      
                                                                 
 dropout (Dropout)           (None, 1024)              0         
                                                                 
 test-14_dense_1 (Dense)     (None, 1024)              1049600   
                                                                 
 test-14_bnorm_1 (BatchNorm  (None, 1024)              4096      
 alization)                                                      
                                                                 
 dropout_1 (Dropout)         (None, 1024)              0         
                                                                 
 test-14_dense_2 (Dense)     (None, 512)               524800    
                                                                 
 test-14_bnorm_2 (BatchNorm  (None, 512)               2048      
 alization)                                                      
                                                                 
 dropout_2 (Dropout)         (None, 512)               0         
                                                                 
 test-14_dense_3 (Dense)     (None, 512)               262656    
                                                                 
 test-14_bnorm_3 (BatchNorm  (None, 512)               2048      
 alization)                                                      
                                                                 
 dropout_3 (Dropout)         (None, 512)               0         
                                                                 
 test-14_dense_4 (Dense)     (None, 256)               131328    
                                                                 
 test-14_bnorm_4 (BatchNorm  (None, 256)               1024      
 alization)                                                      
                                                                 
 dropout_4 (Dropout)         (None, 256)               0         
                                                                 
 test-14_dense_5 (Dense)     (None, 256)               65792     
                                                                 
 test-14_bnorm_5 (BatchNorm  (None, 256)               1024      
 alization)                                                      
                                                                 
 dropout_5 (Dropout)         (None, 256)               0         
                                                                 
 test-14_dense_6 (Dense)     (None, 128)               32896     
                                                                 
 test-14_bnorm_6 (BatchNorm  (None, 128)               512       
 alization)                                                      
                                                                 
 dropout_6 (Dropout)         (None, 128)               0         
                                                                 
 test-14_dense_7 (Dense)     (None, 128)               16512     
                                                                 
 test-14_bnorm_7 (BatchNorm  (None, 128)               512       
 alization)                                                      
                                                                 
 dropout_7 (Dropout)         (None, 128)               0         
                                                                 
 test-14_dense_8 (Dense)     (None, 64)                8256      
                                                                 
 test-14_bnorm_8 (BatchNorm  (None, 64)                256       
 alization)                                                      
                                                                 
 dropout_8 (Dropout)         (None, 64)                0         
                                                                 
 test-14_dense_9 (Dense)     (None, 16)                1040      
                                                                 
 test-14_bnorm_9 (BatchNorm  (None, 16)                64        
 alization)                                                      
                                                                 
 dropout_9 (Dropout)         (None, 16)                0         
                                                                 
 output (Dense)              (None, 2)                 34        
                                                                 
=================================================================
Total params: 2113714 (8.06 MB)
Trainable params: 2105874 (8.03 MB)
Non-trainable params: 7840 (30.62 KB)
_________________________________________________________________
