Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 8)]               0         
_________________________________________________________________
ffm-3_dense_0 (Dense)        (None, 64)                576       
_________________________________________________________________
ffm-3_bnorm_0 (BatchNormaliz (None, 64)                256       
_________________________________________________________________
ffm-3_dense_1 (Dense)        (None, 64)                4160      
_________________________________________________________________
ffm-3_bnorm_1 (BatchNormaliz (None, 64)                256       
_________________________________________________________________
ffm-3_dense_2 (Dense)        (None, 64)                4160      
_________________________________________________________________
ffm-3_bnorm_2 (BatchNormaliz (None, 64)                256       
_________________________________________________________________
ffm-3_dense_3 (Dense)        (None, 32)                2080      
_________________________________________________________________
ffm-3_bnorm_3 (BatchNormaliz (None, 32)                128       
_________________________________________________________________
ffm-3_dense_4 (Dense)        (None, 32)                1056      
_________________________________________________________________
ffm-3_bnorm_4 (BatchNormaliz (None, 32)                128       
_________________________________________________________________
ffm-3_dense_5 (Dense)        (None, 32)                1056      
_________________________________________________________________
ffm-3_bnorm_5 (BatchNormaliz (None, 32)                128       
_________________________________________________________________
ffm-3_dense_6 (Dense)        (None, 16)                528       
_________________________________________________________________
ffm-3_bnorm_6 (BatchNormaliz (None, 16)                64        
_________________________________________________________________
ffm-3_dense_7 (Dense)        (None, 16)                272       
_________________________________________________________________
ffm-3_bnorm_7 (BatchNormaliz (None, 16)                64        
_________________________________________________________________
output (Dense)               (None, 2)                 34        
=================================================================
Total params: 15,202
Trainable params: 14,562
Non-trainable params: 640
_________________________________________________________________
