Model: "variational_encoder_decoder"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 model (Functional)          ((None, 4),               46184     
                              (None, 4))                         
                                                                 
 model_1 (Functional)        (None, 2)                 514       
                                                                 
=================================================================
Total params: 46698 (182.41 KB)
Trainable params: 45674 (178.41 KB)
Non-trainable params: 1024 (4.00 KB)
_________________________________________________________________
