Model: "variational_encoder_decoder"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 model (Functional)          ((None, 6),               46316     
                              (None, 6))                         
                                                                 
 model_1 (Functional)        (None, 2)                 80        
                                                                 
=================================================================
Total params: 46396 (181.23 KB)
Trainable params: 45424 (177.44 KB)
Non-trainable params: 972 (3.80 KB)
_________________________________________________________________
