Model: "variational_encoder_decoder"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 model (Functional)          ((None, 8),               2113952   
                              (None, 8))                         
                                                                 
 model_1 (Functional)        (None, 2)                 19026     
                                                                 
=================================================================
Total params: 2132978 (8.14 MB)
Trainable params: 2124594 (8.10 MB)
Non-trainable params: 8384 (32.75 KB)
_________________________________________________________________
