Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 8)]               0         
_________________________________________________________________
ffm-4_dense_0 (Dense)        (None, 256)               2304      
_________________________________________________________________
ffm-4_bnorm_0 (BatchNormaliz (None, 256)               1024      
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
ffm-4_dense_1 (Dense)        (None, 256)               65792     
_________________________________________________________________
ffm-4_bnorm_1 (BatchNormaliz (None, 256)               1024      
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
ffm-4_dense_2 (Dense)        (None, 128)               32896     
_________________________________________________________________
ffm-4_bnorm_2 (BatchNormaliz (None, 128)               512       
_________________________________________________________________
dropout_2 (Dropout)          (None, 128)               0         
_________________________________________________________________
ffm-4_dense_3 (Dense)        (None, 128)               16512     
_________________________________________________________________
ffm-4_bnorm_3 (BatchNormaliz (None, 128)               512       
_________________________________________________________________
dropout_3 (Dropout)          (None, 128)               0         
_________________________________________________________________
ffm-4_dense_4 (Dense)        (None, 64)                8256      
_________________________________________________________________
ffm-4_bnorm_4 (BatchNormaliz (None, 64)                256       
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
ffm-4_dense_5 (Dense)        (None, 64)                4160      
_________________________________________________________________
ffm-4_bnorm_5 (BatchNormaliz (None, 64)                256       
_________________________________________________________________
dropout_5 (Dropout)          (None, 64)                0         
_________________________________________________________________
ffm-4_dense_6 (Dense)        (None, 64)                4160      
_________________________________________________________________
ffm-4_bnorm_6 (BatchNormaliz (None, 64)                256       
_________________________________________________________________
dropout_6 (Dropout)          (None, 64)                0         
_________________________________________________________________
ffm-4_dense_7 (Dense)        (None, 32)                2080      
_________________________________________________________________
ffm-4_bnorm_7 (BatchNormaliz (None, 32)                128       
_________________________________________________________________
dropout_7 (Dropout)          (None, 32)                0         
_________________________________________________________________
ffm-4_dense_8 (Dense)        (None, 32)                1056      
_________________________________________________________________
ffm-4_bnorm_8 (BatchNormaliz (None, 32)                128       
_________________________________________________________________
dropout_8 (Dropout)          (None, 32)                0         
_________________________________________________________________
ffm-4_dense_9 (Dense)        (None, 32)                1056      
_________________________________________________________________
ffm-4_bnorm_9 (BatchNormaliz (None, 32)                128       
_________________________________________________________________
dropout_9 (Dropout)          (None, 32)                0         
_________________________________________________________________
ffm-4_dense_10 (Dense)       (None, 16)                528       
_________________________________________________________________
ffm-4_bnorm_10 (BatchNormali (None, 16)                64        
_________________________________________________________________
dropout_10 (Dropout)         (None, 16)                0         
_________________________________________________________________
ffm-4_dense_11 (Dense)       (None, 16)                272       
_________________________________________________________________
ffm-4_bnorm_11 (BatchNormali (None, 16)                64        
_________________________________________________________________
dropout_11 (Dropout)         (None, 16)                0         
_________________________________________________________________
output (Dense)               (None, 2)                 34        
=================================================================
Total params: 143,458
Trainable params: 141,282
Non-trainable params: 2,176
_________________________________________________________________
