Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input (InputLayer)          [(None, 4)]               0         
                                                                 
 test-11_dense_0 (Dense)     (None, 128)               640       
                                                                 
 test-11_bnorm_0 (BatchNorm  (None, 128)               512       
 alization)                                                      
                                                                 
 test-11_dense_1 (Dense)     (None, 128)               16512     
                                                                 
 test-11_bnorm_1 (BatchNorm  (None, 128)               512       
 alization)                                                      
                                                                 
 test-11_dense_2 (Dense)     (None, 64)                8256      
                                                                 
 test-11_bnorm_2 (BatchNorm  (None, 64)                256       
 alization)                                                      
                                                                 
 test-11_dense_3 (Dense)     (None, 64)                4160      
                                                                 
 test-11_bnorm_3 (BatchNorm  (None, 64)                256       
 alization)                                                      
                                                                 
 output (Dense)              (None, 2)                 130       
                                                                 
=================================================================
Total params: 31234 (122.01 KB)
Trainable params: 30466 (119.01 KB)
Non-trainable params: 768 (3.00 KB)
_________________________________________________________________
