Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input (InputLayer)          [(None, 4)]               0         
                                                                 
 test-13_dense_0 (Dense)     (None, 512)               2560      
                                                                 
 test-13_bnorm_0 (BatchNorm  (None, 512)               2048      
 alization)                                                      
                                                                 
 test-13_dense_1 (Dense)     (None, 512)               262656    
                                                                 
 test-13_bnorm_1 (BatchNorm  (None, 512)               2048      
 alization)                                                      
                                                                 
 test-13_dense_2 (Dense)     (None, 512)               262656    
                                                                 
 test-13_bnorm_2 (BatchNorm  (None, 512)               2048      
 alization)                                                      
                                                                 
 test-13_dense_3 (Dense)     (None, 256)               131328    
                                                                 
 test-13_bnorm_3 (BatchNorm  (None, 256)               1024      
 alization)                                                      
                                                                 
 test-13_dense_4 (Dense)     (None, 256)               65792     
                                                                 
 test-13_bnorm_4 (BatchNorm  (None, 256)               1024      
 alization)                                                      
                                                                 
 test-13_dense_5 (Dense)     (None, 128)               32896     
                                                                 
 test-13_bnorm_5 (BatchNorm  (None, 128)               512       
 alization)                                                      
                                                                 
 test-13_dense_6 (Dense)     (None, 64)                8256      
                                                                 
 test-13_bnorm_6 (BatchNorm  (None, 64)                256       
 alization)                                                      
                                                                 
 output (Dense)              (None, 2)                 130       
                                                                 
=================================================================
Total params: 775234 (2.96 MB)
Trainable params: 770754 (2.94 MB)
Non-trainable params: 4480 (17.50 KB)
_________________________________________________________________
