Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 7)]               0         
_________________________________________________________________
ffm-0_dense_0 (Dense)        (None, 512)               4096      
_________________________________________________________________
ffm-0_bnorm_0 (BatchNormaliz (None, 512)               2048      
_________________________________________________________________
ffm-0_dense_1 (Dense)        (None, 256)               131328    
_________________________________________________________________
ffm-0_bnorm_1 (BatchNormaliz (None, 256)               1024      
_________________________________________________________________
ffm-0_dense_2 (Dense)        (None, 128)               32896     
_________________________________________________________________
ffm-0_bnorm_2 (BatchNormaliz (None, 128)               512       
_________________________________________________________________
ffm-0_dense_3 (Dense)        (None, 16)                2064      
_________________________________________________________________
ffm-0_bnorm_3 (BatchNormaliz (None, 16)                64        
_________________________________________________________________
output (Dense)               (None, 2)                 34        
=================================================================
Total params: 174,066
Trainable params: 172,242
Non-trainable params: 1,824
_________________________________________________________________
