Model: "model"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 input (InputLayer)          [(None, 4)]               0         
                                                                 
 test-8_dense_0 (Dense)      (None, 64)                320       
                                                                 
 test-8_bnorm_0 (BatchNorma  (None, 64)                256       
 lization)                                                       
                                                                 
 dropout (Dropout)           (None, 64)                0         
                                                                 
 test-8_dense_1 (Dense)      (None, 32)                2080      
                                                                 
 test-8_bnorm_1 (BatchNorma  (None, 32)                128       
 lization)                                                       
                                                                 
 dropout_1 (Dropout)         (None, 32)                0         
                                                                 
 test-8_dense_2 (Dense)      (None, 32)                1056      
                                                                 
 test-8_bnorm_2 (BatchNorma  (None, 32)                128       
 lization)                                                       
                                                                 
 dropout_2 (Dropout)         (None, 32)                0         
                                                                 
 test-8_dense_3 (Dense)      (None, 32)                1056      
                                                                 
 test-8_bnorm_3 (BatchNorma  (None, 32)                128       
 lization)                                                       
                                                                 
 dropout_3 (Dropout)         (None, 32)                0         
                                                                 
 test-8_dense_4 (Dense)      (None, 16)                528       
                                                                 
 test-8_bnorm_4 (BatchNorma  (None, 16)                64        
 lization)                                                       
                                                                 
 dropout_4 (Dropout)         (None, 16)                0         
                                                                 
 test-8_dense_5 (Dense)      (None, 16)                272       
                                                                 
 test-8_bnorm_5 (BatchNorma  (None, 16)                64        
 lization)                                                       
                                                                 
 dropout_5 (Dropout)         (None, 16)                0         
                                                                 
 output (Dense)              (None, 2)                 34        
                                                                 
=================================================================
Total params: 6114 (23.88 KB)
Trainable params: 5730 (22.38 KB)
Non-trainable params: 384 (1.50 KB)
_________________________________________________________________
