Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 7)]               0         
_________________________________________________________________
ffm-1_dense_0 (Dense)        (None, 128)               1024      
_________________________________________________________________
ffm-1_bnorm_0 (BatchNormaliz (None, 128)               512       
_________________________________________________________________
ffm-1_dense_1 (Dense)        (None, 128)               16512     
_________________________________________________________________
ffm-1_bnorm_1 (BatchNormaliz (None, 128)               512       
_________________________________________________________________
ffm-1_dense_2 (Dense)        (None, 64)                8256      
_________________________________________________________________
ffm-1_bnorm_2 (BatchNormaliz (None, 64)                256       
_________________________________________________________________
ffm-1_dense_3 (Dense)        (None, 64)                4160      
_________________________________________________________________
ffm-1_bnorm_3 (BatchNormaliz (None, 64)                256       
_________________________________________________________________
ffm-1_dense_4 (Dense)        (None, 32)                2080      
_________________________________________________________________
ffm-1_bnorm_4 (BatchNormaliz (None, 32)                128       
_________________________________________________________________
ffm-1_dense_5 (Dense)        (None, 16)                528       
_________________________________________________________________
ffm-1_bnorm_5 (BatchNormaliz (None, 16)                64        
_________________________________________________________________
output (Dense)               (None, 2)                 34        
=================================================================
Total params: 34,322
Trainable params: 33,458
Non-trainable params: 864
_________________________________________________________________
